
[
   {
       "countryName": "Azerbaijan",
        "capitalCity": "Baku",
        "population": "10 000 000",
        "places": [
            {
                "title": "Most Beautiful City in Azerbaijan",
                "cityName": "Baku",
                "image": "baku",
                "details":
                {
                    "imageName": "baku",
                    "description": "Baku (US: /bɑːˈkuː, ˈbɑːkuː/, UK: /bæˈkuː, ˈbækuː/;[7][8] Azerbaijani: Bakı [bɑˈcɯ] (audio speaker iconlisten)) is the capital and largest city of Azerbaijan, as well as the largest city on the Caspian Sea and of the Caucasus region.[9] Baku is located 28 metres (92 ft) below sea level, which makes it the lowest lying national capital in the world and also the largest city in the world located below sea level. Baku lies on the southern shore of the Absheron Peninsula, alongside the Bay of Baku. At the beginning of 2009, Baku's urban population was estimated at just over two million people.[10] Officially, about 25% of all inhabitants of the country live in Baku's metropolitan area. Baku is the sole metropolis in Azerbaijan. Baku is divided into twelve administrative raions and 48 townships. Among these are the townships on the islands of the Baku Archipelago, and the town of Oil Rocks built on stilts in the Caspian Sea, 60 kilometres (37 miles) away from Baku. The Inner City of Baku, along with the Shirvanshah's Palace and Maiden Tower, were inscribed as a UNESCO World Heritage Site in 2000. According to the Lonely Planet's ranking, Baku is also among the world's top ten destinations for urban nightlife.[11]"
                }
            },
            {
                "title": "Nakhchivan Autonomous Republic",
                "cityName": "Nakhchivan",
                "image": "nakhchivan",
                "details":
                {
                    "imageName": "nakhchivan",
                    "description": "Nakhchivan (Azerbaijani: Naxçıvan, [nɑxtʃɯˈvɑn]; Armenian: Նախիջևան, romanized: Nakhijevan; Persian: نخجوان, romanized: Nakhjewan; Russian: Нахичевань, romanized: Nakhichevan) is the capital of the eponymous Nakhchivan Autonomous Republic of Azerbaijan, located 450 km (280 mi) west of Baku. The municipality of Nakhchivan consists of the city of Nakhchivan, the settlement of Əliabad and the villages of Başbaşı, Bulqan, Haciniyyət, Qaraçuq (Garachug), Qaraxanbəyli (Garakhanbeyli), Tumbul, Qarağalıq, and Daşduz.[2] It is spread over the foothills of Zangezur Mountains, on the right bank of the Nakhchivan River at an altitude of 873 m (2,864 ft) above sea level. Since 9 June 2009, the Bulqan, Qaraçuq, Qaraxanbəyli, Tumbul and Haciniyyət villages of the Babek District are included in the scope of the administrative-territorial unit of the Nakhchivan city."
                }
            },
            {
                "title": "The Historical City of Azerbaijan",
                "cityName": "Sheki",
                "image": "sheki",
                "details":
                {
                    "imageName": "sheki",
                    "description": "Shaki (Azerbaijani: Şəki) is a city in northwestern Azerbaijan, surrounded by the district of the same name. It is located on the southern part of the Greater Caucasus mountain range, 240 km (150 mi) from Baku. As of 2020, it has a population of 68,400.[2] The center of the city and the Palace of Shaki Khans were inscribed in the UNESCO World Heritage List in 2019 because of its unique architecture and its history as an important trading center along the Silk Road. Shaki was founded in the 8th century B.C.[6] It was one of the biggest cities of the Albanian states in the 1st century. The main temple of the ancient Albanians was located there. The kingdom of Shaki was divided into 11 administrative provinces. Shaki was one of the important political and economic cities before the Arab invasion. But as a result of the invasion, Shaki was annexed to the third emirate. An independent Georgia principality, Hereti, was est"
                }
            },
            {
                "title": "Beautiful City in Azerbaijan",
                "cityName": "Quba",
                "image": "quba",
                "details":
                {
                    "imageName": "quba",
                    "description": "Quba was mentioned in works of various European geographers, in ancient Arabic and Albanian sources. The castle built by the ruler Anushiravan in the 11th century was called Bade-Firuz Qubat, and in the Arabic sources of the XII century Quba was mentioned as Cuba. In the 13th century, in the Dictionary of Geographical names of Arabian scientist Hamabi it was mentioned among the Azerbaijani cities as Kubba, and in the sources of 16th century Quba was referred to as Dome. Guba (Quba) city originated from the riverside village of Gudial. In the mid-18th century, after moving his residence from Khudat, Hussain Ali became Quba's Khan (tribal Turkic Muslim ruler) and raised fortress walls around the city.[2] He thereafter attempted to create a state separate from other Azerbaijani khanates. The position of the Quba khanate grew stronger during the reign of Fatali Khan (1758–1789), son of Hussain Ali Khan."
                }
            }
        ]
   },
   {
       "countryName": "Turkey",
        "capitalCity": "Ankara",
        "population": "84 000 000",
        "places": [
            {
                "title": "Ankara is The Capital of Turkey",
                "cityName": "Ankara",
                "image": "ankara",
                "details":
                {
                    "imageName": "ankara",
                    "description": "Serving as the capital of the ancient Celtic state of Galatia (280–64 BC), and later of the Roman province with the same name (25 BC–7th century), the city is very old, with various Hattian, Hittite, Lydian, Phrygian, Galatian, Greek, Persian, Roman, Byzantine, and Ottoman archeological sites. The Ottomans made the city the capital first of the Anatolia Eyalet (1393 – late 15th century) and then the Angora Vilayet (1867–1922). The historical center of Ankara is a rocky hill rising 150 m (500 ft) over the left bank of the Ankara River, a tributary of the Sakarya River. The hill remains crowned by the ruins of Ankara Castle. Although few of its outworks have survived, there are well-preserved examples of Roman and Ottoman architecture throughout the city, the most remarkable being the 20 BC Temple of Augustus and Rome that boasts the Monumentum Ancyranum, the inscription recording the Res Gestae Divi Augusti. On 23 April 1920, the Grand National Assembly of Turkey was established in Ankara, which became the headquarters of the Turkish National Movement during the Turkish War of Independence. Ankara became the new Turkish capital upon the establishment of the Republic on 29 October 1923, succeeding in this role as the former Turkish capital Istanbul following the fall of the Ottoman Empire. The government is a prominent employer, but Ankara is also an important commercial and industrial city located at the center of Turkey's road and railway networks. The city gave its name to the Angora wool shorn from Angora rabbits, the long-haired Angora goat (the source of mohair), and the Angora cat. The area is also known for its pears, honey and muscat grapes. Although situated in one of the driest regions of Turkey and surrounded mostly by steppe vegetation (except for the forested areas on the southern periphery), Ankara can be considered a green city in terms of green areas per inhabitant, at 72 square meters (775 square feet) per head."
                }
            },
            {
                "title": "Istanbul is Beautiful City",
                "cityName": "Istanbul",
                "image": "istanbul",
                "details":
                {
                    "imageName": "istanbul",
                    "description": "Istanbul (/ˌɪstænˈbʊl/ IST-an-BUUL,[7][8] US also /ˈɪstænbʊl/ IST-an-buul; Turkish: İstanbul [isˈtanbuɫ] (audio speaker iconlisten)), formerly known as Constantinople, is the largest city in Turkey, serving as the country's economic, cultural and historic hub. The city straddles the Bosporus strait, lying in both Europe and Asia, and has a population of over 15 million residents, comprising 19% of the population of Turkey.[4] Istanbul is the most populous European city,[b] and the world's 15th-largest city. The city was founded as Byzantium (Byzantion) in the 7th century BC by Greek settlers from Megara.[9] In 330 CE, the Roman emperor Constantine the Great made it his imperial capital, renaming it first as New Rome (Nova Roma)[10] and then as Constantinople (Constantinopolis) after himself.[10][11] The city grew in size and influence, eventually becoming a beacon of the Silk Road and one of the most important cities in history. The city served as an imperial capital for almost 1600 years: during the Roman/Byzantine (330–1204), Latin (1204–1261), late Byzantine (1261–1453), and Ottoman (1453–1922) empires.[12] The city played a key role in the advancement of Christianity during Roman/Byzantine times, hosting four (including Chalcedon (Kadıköy) on the Asian side) of the first seven ecumenical councils (all of which were in present-day Turkey) before its transformation to an Islamic stronghold following the Fall of Constantinople in 1453 CE—especially after becoming the seat of the Ottoman Caliphate in 1517.[13]"
                }
            },
            {
                "title": "Beautiful City in Turkey",
                "cityName": "Denizli",
                "image": "denizli",
                "details":
                {
                    "imageName": "denizli",
                    "description": "Denizli is an industrial city in the southwestern part of Turkey and the eastern end of the alluvial valley formed by the river Büyük Menderes, where the plain reaches an elevation of about three hundred and fifty metres (1,148 ft). Denizli is located in the country's Aegean Region. The city has a population of about 646,278 (2018 census). This is a jump from 389,000 in 2007, due to the merger of 13 municipalities and 10 villages when the area under Denizli Municipality jurisdiction increased almost fivefold and the population around 50 percent. Denizli (Municipality) is the capital city of Denizli Province. Denizli has seen economic development in the last few decades, mostly due to textile production and exports.Denizli also attracts visitors to the nearby mineral-coated hillside hot spring of Pamukkale, and with red color thermal water spa hotels Karahayıt, just 5 kilometres (3 miles) north of Pamukkale. Recently, Denizli became a major domestic tourism destination due to the various types of thermal waters in Sarayköy, Central/Denizli (where Karahayıt and Pamukkale towns are located), Akköy (Gölemezli), Buldan (Yenicekent), and Çardak districts. The ancient ruined city of Hierapolis, as well as ruins of the city of Laodicea on the Lycus, the ancient metropolis of Phrygia. Also in the depending of Honaz, about 10 mi (16 km) west of Denizli is, what was, in the 1st century AD, the city of Colossae."
                }
            },
            {
                "title": "Izmir is Beautiful City",
                "cityName": "Izmir",
                "image": "izmir",
                "details":
                {
                    "imageName": "izmir",
                    "description": "Izmir (UK: /ˈɪzmɪər/ IZ-meer, US: /ɪzˈmɪər/ iz-MEER; Turkish: İzmir, Turkish pronunciation: [ˈizmiɾ]) is a metropolitan city in the western extremity of Anatolia, capital of the province of the same name. It is the third most populous city in Turkey, after Istanbul and Ankara; and the second largest urban agglomeration on the Aegean Sea after Athens. As of the last 31/12/2019 estimation, the city of İzmir had a population of 2,965,900, while İzmir Province had a total population of 4,367,251.[2][3] Its built-up (or metro) area was home to 3,209,179 inhabitants extending on 9 out of 11 urban districts (all but Urla and Guzelbahce not yet agglomerated) plus Menemen and Menderes largely conurbated. It extends along the outlying waters of the Gulf of İzmir and inland to the north across the Gediz River Delta; to the east along an alluvial plain created by several small streams; and to slightly more rugged terrain in the south.[5] İzmir has more than 3,000 years of recorded urban history, and up to 8,500 years of history as a human settlement since the Neolithic period. In classical antiquity the city was known as Smyrna (/ˈsmɜːrnə/ SMUR-nə; Greek: Σμύρνη, romanized: Smýrni/Smýrnē) – a name which remained in use in English and various other languages until around 1930, when government efforts led the original Greek name to be gradually phased out internationally in favor of its Turkish counterpart İzmir.[6] Lying on an advantageous location at the head of a gulf running down in a deep indentation, midway along the western Anatolian coast, İzmir has been one of the principal mercantile cities of the Mediterranean Sea for much of its history. It hosted the Mediterranean Games in 1971 and the World University Games (Universiade) in 2005. The city participated in Climathon in 2019. "
                }
            }
        ]
   },
   {
       "countryName": "Russia",
        "capitalCity": "Moscow",
        "population": "114 000 000",
        "places": [
            {
                "title": "Moscow is Beautiful City",
                "cityName": "Moscow",
                "image": "moscow",
                "details":
                {
                    "imageName": "moscow",
                    "description": "Moscow (/ˈmɒskoʊ/ MOS-koh, US chiefly /ˈmɒskaʊ/ MOS-kow;[10][11] Russian: Москва, tr. Moskva, IPA: [mɐˈskva] (audio speaker iconlisten)) is the capital and largest city of Russia. The city stands on the Moskva River in Central Russia, with a population estimated at 12.4 million residents within the city limits,[12] over 17 million residents in the urban area,[13] and over 20 million residents in the metropolitan area.[14] The city covers an area of 2,511 square kilometers (970 sq mi), while the urban area covers 5,891 square kilometers (2,275 sq mi),[13] and the metropolitan area covers over 26,000 square kilometers (10,000 sq mi).[14] Moscow is among the world's largest cities; being the most populous city entirely in Europe, the largest urban and metropolitan area in Europe,[13][14] and the largest city by land area on the European continent. First documented in 1147, Moscow grew to become a prosperous and powerful city that served as the capital of the Grand Duchy that bears its name. When the Grand Duchy of Moscow evolved into the Tsardom of Russia, Moscow still remained as the political and economic center for most of the Tsardom's history. When the Tsardom was reformed into the Russian Empire, the capital was moved from Moscow to Saint Petersburg diminishing the influence of the city. The capital was then moved back to Moscow following the October Revolution and the city was brought back as the political center of the Russian SFSR and then the Soviet Union.[16] In the aftermath of the dissolution of the Soviet Union, Moscow remained as the capital city of the contemporary and newly established Russian Federation."
                }
            },
            {
                "title": "Saint Petersburg is Cold City",
                "cityName": "Saint Petersburg",
                "image": "saintpetersburg",
                "details":
                {
                    "imageName": "saintpetersburg",
                    "description": "Saint Petersburg (Russian: Санкт-Петербург, tr. Sankt-Peterburg, IPA: [ˈsankt pʲɪtʲɪrˈburk] (audio speaker iconlisten)), formerly known as Petrograd (1914–1924) and later Leningrad (1924–1991), is the second-largest city in Russia. It is situated on the Neva River, at the head of the Gulf of Finland on the Baltic Sea, with a population of roughly 5.4 million residents.[9] Saint Petersburg is the fourth-most populous city in Europe, the most populous city on the Baltic Sea, as well as the world's northernmost city with over 1 million residents. As Russia's Imperial capital, and a historically strategic port, it is governed as a federal city.The city was founded by Tsar Peter the Great on 27 May 1703 on the site of a captured Swedish fortress, and was named after apostle Saint Peter. In Russia, Saint Petersburg is historically and culturally associated with the birth of the Russian Empire and Russia's entry into modern history as a European great power.[10] It served as a capital of the Tsardom of Russia, and the subsequent Russian Empire, from 1713 to 1918 (being replaced by Moscow for a short period of time between 1728 and 1730).[11] After the October Revolution in 1917, the Bolsheviks moved their government to Moscow.[12]"
                }
            },
            {
                "title": "Novosibirsk is Cold",
                "cityName": "Novosibirsk",
                "image": "novosibirsk",
                "details":
                {
                    "imageName": "novosibirsk",
                    "description": "Novosibirsk (/ˌnoʊvəsɪˈbɪərsk, -voʊs-/, also UK: /ˌnɒv-/;[19][20] Russian: Новосиби́рск, IPA: [nəvəsʲɪˈbʲirsk] (audio speaker iconlisten)) is the largest city and administrative centre of Novosibirsk Oblast and Siberian Federal District in Russia. It had a population of 1,612,833 in 2018,[21] making it the most populous city in Siberia and the third-most populous city in Russia. The city is located in southwestern Siberia, on the banks of the Ob River.[22]Novosibirsk was founded in 1893 on the Ob River crossing point of the future Trans-Siberian Railway, where the Novosibirsk Rail Bridge was constructed. Originally named Novonikolayevsk, the city grew rapidly into a major transport, commercial, and industrial hub. The city was ravaged by the Russian Civil War but recovered during the early Soviet period, and gained its present name in 1926. Under the leadership of Joseph Stalin, Novosibirsk became one of the largest industrial centers of Siberia. Following the outbreak of World War II, the city hosted many factories relocated from the Russian core.Novosibirsk is home to numerous Russian corporations, the neo-Byzantine Alexander Nevsky Cathedral, the Novosibirsk Opera and Ballet Theatre, as well as the world-renowned Novosibirsk Zoo. It is served by Tolmachevo Airport, the busiest airport in Siberia.[23]"
                }
            },
            {
                "title": "One of the Top 5 City of Russia",
                "cityName": "Yekaterinburg",
                "image": "yekaterinburg",
                "details":
                {
                    "imageName": "yekaterinburg",
                    "description": "Yekaterinburg (/jɪˈkætərɪnbɜːrɡ/ yih-KAT-ər-in-burg;[13] Russian: Екатеринбург, IPA: [jɪkətʲɪrʲɪnˈburk]), alternatively romanized Ekaterinburg, formerly known as Sverdlovsk (Russian: Свердло́вск, IPA: [svʲɪrˈdlofsk], 1924–1991), is the largest city and the administrative centre of Sverdlovsk Oblast and the Ural Federal District, Russia. The city is located on the Iset River between the Volga-Ural region and Siberia, with a population of roughly 1.5 million residents,[14] up to 2.2 million residents in the urban agglomeration. Yekaterinburg is the fourth-largest city in Russia, the largest city in the Ural Federal District, and one of Russia's main cultural and industrial centres. Yekaterinburg has been dubbed the Third capital of Russia, as it is ranked third by the size of its economy, culture, transportation and tourism.Yekaterinburg was founded on 18 November 1723 and named after the Russian emperor Peter the Great's wife, who after his death became Catherine I, Yekaterina being the Russian form of her name. The city served as the mining capital of the Russian Empire as well as a strategic connection between Europe and Asia. In 1781, Catherine the Great gave Yekaterinburg the status of a district town of Perm Province, and built the historical Siberian Route through the city.[3] Yekaterinburg became a key city to Siberia, which had rich resources. In the late 19th century, Yekaterinburg became one of the centres of revolutionary movements in the Urals. In 1924, after the Russian SFSR became a part of the Soviet Union, and a socialist state, the city was named Sverdlovsk after the Bolshevik leader Yakov Sverdlov. During the Soviet era, Sverdlovsk was turned into an industrial and administrative powerhouse. In 1991, after the dissolution of the Soviet Union, the city returned to its historical name"
                }
            }
        ]
   },
   {
       "countryName": "USA",
        "capitalCity": "Washington",
        "population": "329 000 000",
        "places": [
            {
                "title": "Los Angeles is My Favorite City",
                "cityName": "Los Angeles",
                "image": "losangeles",
                "details":
                {
                    "imageName": "losangeles",
                    "description": "Los Angeles (US: /lɔːs ˈændʒələs/ (audio speaker iconlisten) lawss AN-jəl-əs;[a] Spanish: Los Ángeles [los ˈaŋxeles], lit. 'The Angels'), often referred to by its initials L.A.,[14] is the largest city in California. With a 2020 population of 3,898,747,[10] it is the second-largest city in the United States, following New York City. Los Angeles is known for its Mediterranean climate, ethnic and cultural diversity, Hollywood film industry and sprawling metropolitan area.The City of Los Angeles lies in a basin in Southern California, adjacent to the Pacific Ocean, and extends through the Santa Monica Mountains and into the San Fernando Valley, covering a total of about 469 square miles (1,210 km2).[7] It is the seat of Los Angeles County, which is the most populous county in the United States with just over 10 million residents in 2020. Home to the Chumash and Tongva indigenous peoples, the area that became Los Angeles was claimed by Juan Rodríguez Cabrillo for Spain in 1542. The city was founded on September 4, 1781, under Spanish governor Felipe de Neve, on the village of Yaanga.[15] It became a part of Mexico in 1821 following the Mexican War of Independence. In 1848, at the end of the Mexican–American War, Los Angeles and the rest of California were purchased as part of the Treaty of Guadalupe Hidalgo, and thus became part of the United States. Los Angeles was incorporated as a municipality on April 4, 1850, five months before California achieved statehood. The discovery of oil in the 1890s brought rapid growth to the city.[16] The city was further expanded with the completion of the Los Angeles Aqueduct in 1913, which delivers water from Eastern California."
                }
            },
            {
                "title": "City in California",
                "cityName": "San Francisco",
                "image": "sanfrancisco",
                "details":
                {
                    "imageName": "sanfrancisco",
                    "description": "San Francisco (/ˌsæn frənˈsɪskoʊ/; Spanish for Saint Francis), officially the City and County of San Francisco, is a cultural, commercial, and financial center in the U.S. state of California. Located in Northern California, San Francisco is the 17th most populous city proper in the United States, and the fourth most populous in California, with 873,965 residents as of 2020.[15] It covers an area of about 46.9 square miles (121 square kilometers),[20] mostly at the north end of the San Francisco Peninsula in the San Francisco Bay Area, making it the second most densely populated large U.S. city, and the fifth most densely populated U.S. county, behind only four of the five New York City boroughs. San Francisco is the 12th-largest metropolitan statistical area in the United States with 4.7 million residents, and the fourth-largest by economic output, with a GDP of $592 billion in 2019.[21] With San Jose, it forms the San Jose–San Francisco–Oakland, CA Combined Statistical Area, the fifth most populous combined statistical area in the United States, with 9.6 million residents as of 2019. Colloquial nicknames for San Francisco include SF, San Fran, The City, and Frisco.In 2019, San Francisco was the county with the seventh-highest income in the United States, with a per capita income of $139,405.[24] In the same year, San Francisco proper had a GDP of $203.5 billion, and a GDP per capita of $230,829.[21][25] The San Jose–San Francisco–Oakland, CA Combined Statistical Area, with a GDP of $1.09 trillion as of 2019, is the country's third-largest economy.[26] Of the 105 primary statistical areas in the U.S. with over 500,000 residents, this CSA had the highest GDP per capita in 2019, at $112,348.[26] San Francisco was ranked 5th in the world and second in the United States on the Global Financial Centres Index as of September 2021.[27]"
                }
            },
            {
                "title": "Las Vegas is Beautiful",
                "cityName": "Las Vegas",
                "image": "lasvegas",
                "details":
                {
                    "imageName": "lasvegas",
                    "description": "Las Vegas (/lɒsˈveɪɡəs/; Spanish for The Meadows), often known simply as Vegas, is the 26th-most populous city in the United States, the most populous city in the state of Nevada, and the county seat of Clark County. The city anchors the Las Vegas Valley metropolitan area and is the largest city within the greater Mojave Desert.[7] Las Vegas is an internationally renowned major resort city, known primarily for its gambling, shopping, fine dining, entertainment, and nightlife. The Las Vegas Valley as a whole serves as the leading financial, commercial, and cultural center for Nevada. The city bills itself as The Entertainment Capital of the World, and is famous for its luxurious and extremely large casino-hotels together with their associated activities. It is a top three destination in the United States for business conventions and a global leader in the hospitality industry, claiming more AAA Five Diamond hotels than any other city in the world.[8][9][10] Today, Las Vegas annually ranks as one of the world's most visited tourist destinations.[11][12] The city's tolerance for numerous forms of adult entertainment earned it the title of Sin City,[13] and has made Las Vegas a popular setting for literature, films, television programs, and music videos."
                }
            },
            {
                "title": "New York is Beautiful",
                "cityName": "New York",
                "image": "newyork",
                "details":
                {
                    "imageName": "newyork",
                    "description": "New York, often called New York City (NYC) to distinguish it from the state of New York, is the most populous city in the United States. With a 2020 population of 8,804,190 distributed over 300.46 square miles (778.2 km2), New York City is also the most densely populated major city in the United States. Located at the southern tip of the state of New York, the city is the center of the New York metropolitan area, the largest metropolitan area in the world by urban area.[9] With over 20.1 million people in its metropolitan statistical area and 23.5 million in its combined statistical area as of 2020, New York is one of the world's most populous megacities. New York City has been described as the cultural, financial, and media capital of the world, and is a significant influence on commerce, entertainment, research, technology, education, politics, tourism, dining, art, fashion, and sports. In addition to its other feats, the city also holds the title of the most photographed city in the world.[10] Home to the headquarters of the United Nations, New York is an important center for international diplomacy,[11][12] and has sometimes been called the capital of the world."
                }
            }
        ]
   },
   {
       "countryName": "Canada",
        "capitalCity": "Ottawa",
        "population": "38 000 000",
        "places": [
            {
                "title": "Toronto is Beautiful City",
                "cityName": "Toronto",
                "image": "toronto",
                "details":
                {
                    "imageName": "toronto",
                    "description": "Toronto (/təˈrɒntoʊ/ (audio speaker iconlisten) tə-RON-toh, locally /təˈrɒntə/ (audio speaker iconlisten) tə-RON-tə or /ˈtrɒntə/ TRON-tə)[12][13][14] is the capital city of the Canadian province of Ontario. With a recorded population of 2,794,356 in 2021,[15] it is the most populous city in Canada and the fourth most populous city in North America. The city is the anchor of the Golden Horseshoe, an urban agglomeration of 9,765,188 people (as of 2021) surrounding the western end of Lake Ontario,[16] while the Greater Toronto Area proper had a 2021 population of 6,712,341.[17] Toronto is an international centre of business, finance, arts, and culture, and is recognized as one of the most multicultural and cosmopolitan cities in the world.Indigenous peoples have travelled through and inhabited the Toronto area, located on a broad sloping plateau interspersed with rivers, deep ravines, and urban forest, for more than 10,000 years.[21] After the broadly disputed Toronto Purchase, when the Mississauga surrendered the area to the British Crown,[22] the British established the town of York in 1793 and later designated it as the capital of Upper Canada.[23] During the War of 1812, the town was the site of the Battle of York and suffered heavy damage by American troops.[24] York was renamed and incorporated in 1834 as the city of Toronto. It was designated as the capital of the province of Ontario in 1867 during Canadian Confederation.[25] The city proper has since expanded past its original limits through both annexation and amalgamation to its current area of 630.2 km2 (243.3 sq mi)."
                }
            },
            {
                "title": "City in Ontario, Canada",
                "cityName": "Ottawa",
                "image": "ottawa",
                "details":
                {
                    "imageName": "ottawa",
                    "description": "Ottawa (/ˈɒtəwə/ (audio speaker iconlisten), /ˈɒtəwɑː/; Canadian French pronunciation: ​[ɔtawa]) is the capital city of Canada. Located on the south bank of the Ottawa River in the southern portion of the province of Ontario, Ottawa borders Gatineau, Quebec, and forms the core of the Ottawa–Gatineau census metropolitan area (CMA) and the National Capital Region (NCR).[12] As of 2021, Ottawa had a city population of 1,017,449 and a metropolitan population of 1,488,307, making it the fourth-largest city and fourth-largest metropolitan area in Canada.Founded in 1826 as Bytown, and incorporated as Ottawa in 1855,[13] the city has evolved into the political centre of Canada. Its original boundaries were expanded through numerous annexations and were ultimately replaced by a new city incorporation and amalgamation in 2001 which significantly increased its land area.Ottawa has the most educated population among Canadian cities[14] and is home to a number of colleges and universities, research and cultural institutions, including the University of Ottawa, Carleton University, the National Arts Centre, the National Gallery of Canada, and numerous national museums.[15]."
                }
            },
            {
                "title": "Student City in Canada",
                "cityName": "Montreal",
                "image": "montreal",
                "details":
                {
                    "imageName": "montreal",
                    "description": "Montreal (/ˌmʌntriˈɔːl/ (audio speaker iconlisten) MUN-tree-AWL; officially Montréal, French: [mɔ̃ʁeal] (audio speaker iconlisten)) is the second-most populous city in Canada and most populous city in the Canadian province of Quebec. Founded in 1642 as Ville-Marie, or City of Mary,[14] it is named after Mount Royal,[15] the triple-peaked hill around which the early city of Ville-Marie is built [16]. The city is centred on the Island of Montreal, which obtained its name from the same origin as the city,[17][18] and a few much smaller peripheral islands, the largest of which is Île Bizard. The city is situated 196 km (122 mi) east of the national capital Ottawa, and 258 km (160 mi) southwest of the provincial capital, Quebec City.As of 2021, the city had a population of 1,762,949,[citation needed] and a metropolitan population of 4,291,732,[citation needed] making it the second-largest city, and second-largest metropolitan area in Canada. French is the city's official language[19][20] and in 2016 was the only home language of 53.7% of the population, while 18.2% spoke only English and 18.7% spoke neither French nor English at home.[21] 9.4% spoke a mix of French, English and a foreign language at home. In the larger Montreal Census Metropolitan Area, 71.2% of the population spoke at least French at home, compared to 19.0% who spoke English.[11] Still in 2016, 87.4% of the population of the city of Montreal considered themselves fluent in French while 91.4% could speak it in the metropolitan area.[22][23] Montreal is one of the most bilingual cities in Quebec and Canada, with 57.4% of the population able to speak both English and French.[21] Montreal is the second-largest primarily French-speaking city in the developed world, after Paris.[24][25][26][note 1]"
                }
            },
            {
                "title": "Hot City in British Columbia, Canada",
                "cityName": "Vancouver",
                "image": "vancouver",
                "details":
                {
                    "imageName": "vancouver",
                    "description": "Vancouver (/vænˈkuːvər/ (audio speaker iconlisten) van-KOO-vər) is a major city in western Canada, located in the Lower Mainland region of British Columbia. As the most populous city in the province, the 2021 census recorded 662,248 people in the city, up from 631,486 in 2016. The Greater Vancouver area had a population of 2,642,825 in 2021, making it the third-largest metropolitan area in Canada. Vancouver has the highest population density in Canada, with over 5,400 people per square kilometre.[7][8] Vancouver is one of the most ethnically and linguistically diverse cities in Canada: 52 percent of its residents are not native English speakers,[9][10] 48.9 percent are native speakers of neither English nor French, and 50.6 percent of residents belong to visible minority groups.[11]Vancouver is one of the most livable cities in Canada and in the world.[12][13][14] In terms of housing affordability, Vancouver is also one of the most expensive cities in Canada and in the world.[15] Vancouver plans to become the greenest city in the world. Vancouverism is the city's urban planning design philosophy. Indigenous settlement of Vancouver began more than 10,000 years ago, and the city is on the traditional and unceded territories of the Squamish, Musqueam, and Tsleil-Waututh (Burrard) peoples. The beginnings of the modern city, which was originally named Gastown, grew around the site of a makeshift tavern on the western edges of Hastings Mill that was built on July 1, 1867, and owned by proprietor Gassy Jack. The original site is marked by the Gastown steam clock. Gastown then formally registered as a townsite dubbed Granville, Burrard Inlet. The city was renamed Vancouver in 1886, through a deal with the Canadian Pacific Railway (CPR). The Canadian Pacific transcontinental railway was extended to the city by 1887. The city's large natural seaport on the Pacific Ocean became a vital link in the trade between Asia-Pacific, East Asia, Europe, and Eastern Canada.[16][17]"
                }
            }
        ]
   }
]
  
